## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [3]:
import sqlalchemy

In [4]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [5]:
%load_ext sql

In [6]:
%sql mysql://root:123qwe@localhost/mydb

## 2.1.6 Задание

Создать таблицу **author** следующей структуры:

In [7]:
%%sql
DROP TABLE IF EXISTS author CASCADE;

CREATE TABLE author(
    author_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_author VARCHAR(50)
);

SELECT *FROM author;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.7 Задание

Заполнить таблицу **author**. В нее включить следующих авторов:

* Булгаков М.А.
* Достоевский Ф.М.
* Есенин С.А.
* Пастернак Б.Л.

In [8]:
%%sql
INSERT INTO author (name_author)
VALUES
    ('Булгаков М.А.'),
    ('Достоевский Ф.М.'),
    ('Есенин С.А.'),
    ('Пастернак Б.Л.');

SELECT * FROM author;

 * mysql://root:***@localhost/mydb
4 rows affected.
4 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.')]

## 2.1.8 Создание таблицы с внешними ключами

Для этого задания создадим таблицу **genre**:

In [12]:
%%sql
DROP TABLE IF EXISTS genre CASCADE;

CREATE TABLE IF NOT EXISTS genre
(
    genre_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_genre TEXT
);

INSERT INTO genre(name_genre)
VALUES ('Роман'),
       ('Поэзия');

SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
2 rows affected.
2 rows affected.

[(1, 'Роман'), (2, 'Поэзия')]

Перепишите запрос на создание таблицы **book**, чтобы ее структура соответствовала структуре, показанной на логической схеме (таблица **genre** уже создана, порядок следования столбцов - как на логической схеме в таблице **book**, **genre_id**  - внешний ключ) . Для **genre_id** ограничение о недопустимости пустых значений не задавать. В качестве главной таблицы для описания поля **genre_id** использовать таблицу **genre** следующей структуры:

In [13]:
%%sql
DROP TABLE IF EXISTS book CASCADE;

CREATE TABLE book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2),
    amount INT,
    FOREIGN KEY (author_id)  REFERENCES author (author_id),
    FOREIGN KEY (genre_id)  REFERENCES genre (genre_id)
);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.8 Действия при удалении записи главной таблицы

Создать таблицу **book** той же структуры, что и на предыдущем шаге. Будем считать, что при удалении автора из таблицы **author**, должны удаляться все записи о книгах из таблицы **book**, написанные этим автором. А при удалении жанра из таблицы **genre** для соответствующей записи **book** установить значение **Null** в столбце **genre_id**.

In [14]:
%%sql
DROP TABLE IF EXISTS book CASCADE;

CREATE TABLE book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2),
    amount INT,
    FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.9 Задание

Для этого задания заполним первые 5 строк таблицы **book**:

In [15]:
%%sql
INSERT INTO book(title, author_id, genre_id, price, amount)
VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3),
       ('Белая гвардия', 1, 1, 540.50, 5),
       ('Идиот', 2, 1, 460.00, 10),
       ('Братья Карамазовы', 2, 1, 799.01, 3),
       ('Игрок', 2, 1, 480.50, 10);

 * mysql://root:***@localhost/mydb
5 rows affected.

[]

Добавьте три последние записи (с ключевыми значениями 6, 7, 8) в таблицу **book**, первые 5 записей уже добавлены:

In [16]:
%%sql
INSERT INTO
    book (title, author_id, genre_id,  price, amount)
VALUES
    ('Стихотворения и поэмы', 3, 2, 650.00, 15),
    ('Черный человек', 3, 2, 570.20, 6),
    ('Лирика', 4, 2, 518.99, 2);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
3 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

## 2.2.2 Соединение INNER JOIN

Обновляем существующие таблицы в соответствии с заданиями:

In [5]:
%%sql
INSERT INTO author(name_author)
VALUES ('Лермонтов М.Ю.');

INSERT INTO genre(name_genre)
VALUES ('Приключения');

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.

[]

Вывести название, жанр и цену тех книг, количество которых больше 8, в отсортированном по убыванию цены виде.

In [6]:
%%sql
SELECT
    title,
    name_genre,
    price
FROM
    genre INNER JOIN book
    ON book.genre_id = genre.genre_id
WHERE
    book.amount > 8
ORDER BY
    price DESC

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Стихотворения и поэмы', 'Поэзия', Decimal('650.00')),
 ('Игрок', 'Роман', Decimal('480.50')),
 ('Идиот', 'Роман', Decimal('460.00'))]

ЗЫ. Следующие два блока равнозначны:  
FROM genre INNER JOIN book ON book.genre_id = genre.genre_id  
JOIN genre USING(genre_id)

## 2.2.3 Внешнее соединение LEFT и RIGHT OUTER JOIN

Вывести все жанры, которые не представлены в книгах на складе.

**Пояснение**: При использовании внешнего соединения названия книг и другие столбцы таблицы **book** для жанра тех книг, которого нет на складе, будут содержать значение **Null**.

In [7]:
%%sql
SELECT
    name_genre
FROM
    genre LEFT JOIN book
    ON genre.genre_id = book.genre_id
WHERE
    book.genre_id IS Null;

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Приключения',)]

## 2.2.4 Перекрестное соединение CROSS JOIN

Есть список городов, хранящийся в таблице **city**:
Необходимо в каждом городе провести выставку книг каждого автора в течение 2020 года. Дату проведения выставки выбрать случайным образом. Создать запрос, который выведет город, автора и дату проведения выставки. Последний столбец назвать **Дата**. Информацию вывести, отсортировав сначала в алфавитном порядке по названиям городов, а потом по убыванию дат проведения выставок.

Формируеум таблицу **city**:

In [9]:
%%sql
CREATE TABLE IF NOT EXISTS city
(
    city_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_city TEXT
);

INSERT INTO city(name_city)
VALUES ('Москва'),
       ('Санкт-Петербург'),
       ('Владивосток');

SELECT * FROM city;

 * mysql://root:***@localhost/mydb
0 rows affected.
3 rows affected.
3 rows affected.

[(1, 'Москва'), (2, 'Санкт-Петербург'), (3, 'Владивосток')]

In [10]:
%%sql
SELECT
    c.name_city,
    a.name_author,
    DATE_ADD('2020-01-01', INTERVAL FLOOR(RAND() * 365) DAY) AS Дата
FROM
    city c CROSS JOIN author a
ORDER BY
    name_city ASC,
    Дата DESC;

 * mysql://root:***@localhost/mydb
15 rows affected.

[('Владивосток', 'Достоевский Ф.М.', '2020-12-03'),
 ('Владивосток', 'Пастернак Б.Л.', '2020-11-26'),
 ('Владивосток', 'Булгаков М.А.', '2020-11-09'),
 ('Владивосток', 'Есенин С.А.', '2020-10-23'),
 ('Владивосток', 'Лермонтов М.Ю.', '2020-08-01'),
 ('Москва', 'Булгаков М.А.', '2020-10-14'),
 ('Москва', 'Пастернак Б.Л.', '2020-09-07'),
 ('Москва', 'Лермонтов М.Ю.', '2020-08-04'),
 ('Москва', 'Достоевский Ф.М.', '2020-07-07'),
 ('Москва', 'Есенин С.А.', '2020-01-31'),
 ('Санкт-Петербург', 'Лермонтов М.Ю.', '2020-11-13'),
 ('Санкт-Петербург', 'Булгаков М.А.', '2020-09-02'),
 ('Санкт-Петербург', 'Есенин С.А.', '2020-07-02'),
 ('Санкт-Петербург', 'Пастернак Б.Л.', '2020-04-12'),
 ('Санкт-Петербург', 'Достоевский Ф.М.', '2020-04-04')]

## 2.2.5 Запросы на выборку из нескольких таблиц

Вывести информацию о книгах (жанр, книга, автор), относящихся к жанру, включающему слово «роман» в отсортированном по названиям книг виде.

In [11]:
%%sql
SELECT
    g.name_genre,
    b.title,
    a.name_author
FROM
    genre g INNER JOIN book b
    ON g.genre_id = b.genre_id
    INNER JOIN author a
    ON a.author_id = b.author_id
WHERE
    g.name_genre LIKE '%роман%'
ORDER BY
    title;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Роман', 'Белая гвардия', 'Булгаков М.А.'),
 ('Роман', 'Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Роман', 'Игрок', 'Достоевский Ф.М.'),
 ('Роман', 'Идиот', 'Достоевский Ф.М.'),
 ('Роман', 'Мастер и Маргарита', 'Булгаков М.А.')]

## 2.2.6 Запросы для нескольких таблиц с группировкой

Посчитать количество экземпляров  книг каждого автора из таблицы **author**. Вывести тех авторов, количество книг которых меньше 10, в отсортированном по возрастанию количества виде. Последний столбец назвать **Количество**.

In [12]:
%%sql
SELECT
    a.name_author,
    SUM(amount) AS Количество
FROM
    author a LEFT JOIN book b
    ON a.author_id = b.author_id
GROUP BY
    a.name_author
HAVING
    Количество < 10 OR
    Количество IS Null
ORDER BY
    Количество ASC;

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Лермонтов М.Ю.', None),
 ('Пастернак Б.Л.', Decimal('2')),
 ('Булгаков М.А.', Decimal('8'))]

Как вариант HAVING Количество < 10 OR COUNT(title) = 0

## 2.2.7 Запросы для нескольких таблиц со вложенными запросами

Внисом изменения в таблицу **book**:

In [11]:
%%sql
UPDATE book
SET genre_id = 1
WHERE book_id = 7;

UPDATE book
SET genre_id = 3
WHERE book_id = 2;

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 3, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 1, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре. Поскольку у нас в таблицах так занесены данные, что у каждого автора книги только в одном жанре,  для этого запроса внесем изменения в таблицу **book**. Пусть у нас  книга Есенина «Черный человек» относится к жанру «Роман», а книга Булгакова «Белая гвардия» к «Приключениям» (эти изменения в таблицы уже внесены).

In [12]:
%%sql
SELECT
    a.name_author
FROM
    author a INNER JOIN book b
    ON a.author_id = b.author_id
GROUP BY a.name_author
HAVING
    count(DISTINCT b.genre_id) = 1
ORDER BY
    name_author ASC;

 * mysql://root:***@localhost/mydb
2 rows affected.

[('Достоевский Ф.М.',), ('Пастернак Б.Л.',)]

## 2.2.8 Вложенные запросы в операторах соединения

Вносим изменения в таблицу **book**:

In [28]:
%%sql
UPDATE book
SET amount = 10
WHERE book_id = 8;

UPDATE book
SET genre_id = 1
WHERE book_id = 2;

UPDATE book
SET genre_id = 2
WHERE book_id = 7;

INSERT INTO book(title, author_id, genre_id, price, amount)
VALUES ('Герой нашего времени', 5, 3, 570.59, 2),
       ('Доктор Живаго', 4, 3, 740.50, 5);

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[]

In [21]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
10 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 10),
 (9, 'Герой нашего времени', 5, 3, Decimal('570.59'), 2),
 (10, 'Доктор Живаго', 4, 3, Decimal('740.50'), 5)]

Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги), написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально.

In [22]:
%%sql
SELECT
    b.title, a.name_author, g.name_genre, b.price, b.amount
FROM
    author a INNER JOIN book b
    ON a.author_id = b.author_id
    INNER JOIN genre g 
    ON b.genre_id = g.genre_id
WHERE b.genre_id IN (
    SELECT genre_id
    FROM book 
    GROUP BY genre_id
    HAVING SUM(amount) = (
        SELECT SUM(amount) AS sum_amount
        FROM book
        GROUP BY genre_id
        ORDER BY sum_amount DESC
        LIMIT 1))
ORDER BY
    title ASC;

 * mysql://root:***@localhost/mydb
8 rows affected.

[('Белая гвардия', 'Булгаков М.А.', 'Роман', Decimal('540.50'), 5),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 'Роман', Decimal('799.01'), 3),
 ('Игрок', 'Достоевский Ф.М.', 'Роман', Decimal('480.50'), 10),
 ('Идиот', 'Достоевский Ф.М.', 'Роман', Decimal('460.00'), 10),
 ('Лирика', 'Пастернак Б.Л.', 'Поэзия', Decimal('518.99'), 10),
 ('Мастер и Маргарита', 'Булгаков М.А.', 'Роман', Decimal('670.99'), 3),
 ('Стихотворения и поэмы', 'Есенин С.А.', 'Поэзия', Decimal('650.00'), 15),
 ('Черный человек', 'Есенин С.А.', 'Поэзия', Decimal('570.20'), 6)]

## 2.2.9 Операция соединение, использование USING()

Актуализируем таблицу **book** и **supply**:

In [30]:
%%sql
UPDATE book
SET amount = 2
WHERE book_id = 8;

DELETE FROM book ORDER BY book_id DESC LIMIT 2;
ALTER TABLE book AUTO_INCREMENT = 9;

 * mysql://root:***@localhost/mydb
1 rows affected.
2 rows affected.
0 rows affected.

[]

In [31]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

In [38]:
%%sql
DROP TABLE IF EXISTS supply CASCADE;

CREATE TABLE supply (
    supply_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
);

INSERT INTO
    supply (title, author, price, amount)
VALUES
    ('Доктор Живаго', 'Пастернак Б.Л.', 618.99, 3),
    ('Черный человек', 'Есенин С.А.', 570.20, 6),
    ('Евгений Онегин', 'Пушкин А.С.', 440.80, 5),
    ('Идиот', 'Достоевский Ф.М.', 360.80, 3);

SELECT * FROM supply;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Доктор Живаго', 'Пастернак Б.Л.', Decimal('618.99'), 3),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6),
 (3, 'Евгений Онегин', 'Пушкин А.С.', Decimal('440.80'), 5),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 3)]

Если в таблицах **supply** и **book** есть одинаковые книги, которые имеют равную цену,  вывести их название и автора, а также посчитать общее количество экземпляров книг в таблицах **supply** и **book**, столбцы назвать **Название**, **Автор**  и **Количество**.

In [39]:
%%sql
SELECT
    b.title AS Название, s.author AS Автор, b.amount + s.amount AS Количество
FROM
    author a
    INNER JOIN book b
    USING(author_id)
    INNER JOIN supply s
    USING(title, price);

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Черный человек', 'Есенин С.А.', 12)]